Documents/CRM_ЗаявкаНаДилерскиеОпции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>CRM_ЗаявкаНаДилерскиеОпции</Name>
			<BasedOn>
				<xr:Item>Document.CRM_КоммерческоеПредложение</xr:Item>
				<xr:Item>Document.CRM_ЗаписьНаВыдачу</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_CRM_СтатусЗаявокНаОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комплектация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Цвета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийЛист</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказНаряд</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполненаУспешно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закрыта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Черновик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДопОпции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выбрана</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПсевдоОпция</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПсевдоСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Опция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПсевдоКоличество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Автоработы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выбрана</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПсевдоАвторабота</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПсевдоСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Авторабота</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПсевдоКоличество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/CRM_ДопОпцииОборудование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>CRM_ДопОпцииОборудование</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Комплектация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Цены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Цены</Name>
			<Comment>Цены</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>Тип цен, для которого хранятся цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура для которой сохраняются цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры для которой сохраняются цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>Единица измерения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Поставщик, историю цен которого необходимо хранить. Если &lt;пусто&gt;, то цену установили мы.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/CRM_ВоронкаПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>CRM_ВоронкаПродаж</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>IDK</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтапПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ЭтапыПродаж</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/Renault_CRM_СтатусЗаявокНаОборудование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Renault_CRM_СтатусЗаявокНаОборудование</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаРассмотрении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/CRM_ЗаявкаНаДилерскиеОпции/Ext/ObjectModule.bsl
// Общий журнал
Перем Права Экспорт;
Перем Организация Экспорт;

Функция ПолучитьСписокПечатныхФорм(ДокументСсылка = Неопределено) Экспорт
	Возврат Новый СписокЗначений();	
КонецФункции
//Конец необходимых для общих журналов

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	//Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.CRM_Договор") Тогда
	//	// Заполнение шапки
	//	ДЦ =Renault_CRM .ПолучитьДилерскийЦентрПользователя();
	//	Комплектация = ДанныеЗаполнения.Версия;
	//	Модель = ДанныеЗаполнения.Модель;
	//	Основание = ДанныеЗаполнения.Ссылка;
	//ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.CRM_КоммерческоеПредложение") Тогда
	//	// Заполнение шапки
	//	ДЦ =Renault_CRM .ПолучитьДилерскийЦентрПользователя();
	//	Идк = ДанныеЗаполнения.РабочийЛист;
	//	Запись = Renault_CRM.ПолучитьЗаписьРЛПоIDK(Идк);
	//	Комплектация = Запись.Комплектация;

	//	Модель =Запись.МодельАвтомобиля;
	//	Основание = ДанныеЗаполнения.Ссылка;


	//ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.CRM_ЗаписьНаВыдачу") Тогда
	//	// Заполнение шапки
	//	ДЦ =Renault_CRM .ПолучитьДилерскийЦентрПользователя();
	//	Идк = ДанныеЗаполнения.IDK;
	//	Запись = Renault_CRM.ПолучитьЗаписьРЛПоIDK(Идк);
	//	Комплектация = Запись.Комплектация;

	//	Модель =Запись.МодельАвтомобиля;
	//	Основание = ДанныеЗаполнения.Ссылка;

	//КонецЕсли;
	//НачальноеЗаполнение();
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура НачальноеЗаполнение() Экспорт
	//ДЦ =Renault_CRM .ПолучитьДилерскийЦентрПользователя();
	ДопОпции.Очистить();
	Запрос = Новый Запрос();
	Запрос.Текст ="ВЫБРАТЬ
	              |	CRM_ДопОпцииОборудование.ДилерскийЦентр,
	              |	CRM_ДопОпцииОборудование.Модель,
	              |	CRM_ДопОпцииОборудование.Комплектация,
	              |	CRM_ДопОпцииОборудование.Номенклатура,
	              |	ЦеныСрезПоследних.Цена,
	              |	CRM_ДопОпцииОборудование.Количество
	              |ИЗ
	              |	РегистрСведений.CRM_ДопОпцииОборудование КАК CRM_ДопОпцииОборудование
	              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Цены.СрезПоследних(&Период, ТипЦен = &ТипЦеныКП) КАК ЦеныСрезПоследних
	              |		ПО CRM_ДопОпцииОборудование.Номенклатура = ЦеныСрезПоследних.Номенклатура
	              |ГДЕ
	              |	CRM_ДопОпцииОборудование.ДилерскийЦентр = &ДЦ" ;
	Запрос.УстановитьПараметр("ДЦ",ДилерскийЦентр);
	Запрос.УстановитьПараметр("Период",ТекущаяДата());
    Запрос.УстановитьПараметр("ТипЦеныКп",Renault_РаботаСПравамиПользователя.ПолучитьТипЦенКП(ДилерскийЦентр));
	//Константы.CRM_ТипЦенКП.Получить());
	Результат = Запрос.Выполнить().Выгрузить();
	СписокОпций = Новый Массив();
	Отбор =	Новый Структура();
	Отбор.Вставить("ДилерскийЦентр",ДилерскийЦентр) ;
	Отбор.Вставить("Модель",Справочники.Модели.ПустаяСсылка()) ;
    Отбор.Вставить("Комплектация",Справочники.ВариантыКомплектации.ПустаяСсылка()) ;
	СписокОпцийДилера = Результат.НайтиСтроки(Отбор);
	для Каждого Опц Из СписокОпцийДилера Цикл
		СписокОпций.Добавить(Опц);
	КонецЦикла;
	Если ЗначениеЗаполнено(Модель) Тогда
		Отбор =	Новый Структура();
		Отбор.Вставить("ДилерскийЦентр",ДилерскийЦентр) ;
		Отбор.Вставить("Модель",Модель) ;
	    Отбор.Вставить("Комплектация",Справочники.ВариантыКомплектации.ПустаяСсылка()) ;
		СписокОпцийДилера = Результат.НайтиСтроки(Отбор);
		для Каждого опц Из СписокОпцийДилера Цикл
			СписокОпций.Добавить(Опц);
		КонецЦикла;
		Если ЗначениеЗаполнено(Комплектация) Тогда
			Отбор =	Новый Структура();
			Отбор.Вставить("ДилерскийЦентр",ДилерскийЦентр) ;
			Отбор.Вставить("Модель",Модель) ;
		    Отбор.Вставить("Комплектация",Комплектация) ;
			СписокОпцийДилера = Результат.НайтиСтроки(Отбор);
			Для Каждого опц Из СписокОпцийДилера Цикл
				СписокОпций.Добавить(Опц);
			КонецЦикла;
	     КонецЕсли;

     КонецЕсли;
	 Для Каждого Опция Из СписокОпций Цикл
		НовСтр =  ДопОпции.Добавить();
		НовСтр.Опция = Опция.Номенклатура;
		Если ЗначениеЗаполнено(Опция.Цена) Тогда
			НовСтр.Цена = Опция.Цена;
			НовСтр.Сумма = Опция.Цена*Опция.Количество;
		КонецЕсли;
		НовСтр.Количество= Опция.Количество;
		
		НовСтр.Выбрана = Истина;
	 КонецЦикла;
	
КонецПроцедуры

Функция СоздатьЗаказНаряд() Экспорт
		
	Если ЗначениеЗаполнено(ЗаказНаряд) тогда
		Заказ =  ЗаказНаряд.Ссылка.ПолучитьОбъект();
	Иначе
		Заказ = документы.ЗаказНаряд.СоздатьДокумент();
	КонецЕсли;
	
	Заказ.Автомобиль = Автомобиль;
	Заказ.ВидРемонта = Справочники.ВидыРемонта.КомплектацияАвтомобиля;
	Заказ.Дата = ТекущаяДата();
	Заказ.Товары.Очистить();
	Заказ.Работы.Очистить();
	
	//Заказ.УстановитьНовыйНомер();
	Заказ.Номер = "З"+Номер;
	Заказ.цех = Справочники.Цеха.ОсновнойЦех;
	Если ЗначениеЗаполнено(Клиент) и  (ТипЗнч(Клиент)= Тип("СправочникСсылка.Контрагенты")) тогда
		Заказ.Заказчик = Клиент;
	иначе
		Заказ.Заказчик = Справочники.Контрагенты.ОсновнойПокупатель;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Заказ.Состояние) Тогда
		Заказ.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Заявка;
	КонецЕсли;
	
	Для каждого Оборудование Из ДопОпции  Цикл
		
		Если Оборудование.Выбрана и ЗначениеЗаполнено(Оборудование.Опция) тогда
			
			НовСтрока = Заказ.Товары.Добавить();
			НовСтрока.Номенклатура = Оборудование.Опция;
			НовСтрока.Коэффициент = Оборудование.Опция.ОсновнаяЕдиницаИзмерения.Коэффициент;
			НовСтрока.ЕдиницаИзмерения = Оборудование.Опция.ОсновнаяЕдиницаИзмерения;
			НовСтрока.Количество = Оборудование.Количество;
			НовСтрока.Сумма = Оборудование.Сумма;
			НовСтрока.Цена = Оборудование.Цена;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого СтрокаАвтоработы Из Автоработы  Цикл
		
		Если СтрокаАвтоработы.Выбрана и ЗначениеЗаполнено(СтрокаАвтоработы.Авторабота) тогда
			
			НовСтрока = Заказ.Работы.Добавить();
			НовСтрока.Работа = СтрокаАвтоработы.Авторабота;
			//НовСтрока.Коэффициент = СтрокаАвтоработы.Авторабота.ОсновнаяЕдиницаИзмерения.Коэффициент;
			//НовСтрока.ЕдиницаИзмерения = СтрокаАвтоработы.Авторабота.ОсновнаяЕдиницаИзмерения;
			НовСтрока.Количество = СтрокаАвтоработы.Количество;
			НовСтрока.Сумма = СтрокаАвтоработы.Сумма;
			НовСтрока.Цена = СтрокаАвтоработы.Цена;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Попытка
		
		Заказ.Записать(РежимЗаписиДокумента.Запись);
		ЗаказНаряд = Заказ.Ссылка;
		Статус = Перечисления.Renault_CRM_СтатусЗаявокНаОборудование.Выполнена;
		Записать(РежимЗаписиДокумента.Проведение);
		
	Исключение
		
		Инфа = ИнформацияОбОшибке();
		
	КонецПопытки;
	
	Возврат Заказ.Ссылка;
	
КонецФункции	

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ОтказУд = ложь;
	ОбработкаУдаленияПроведения(ОтказУд);
	НаборЗаявка = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьНаборЗаписей();
	НаборЗаявка.Отбор.IDK.Установить(РабочийЛист);
	НаборЗаявка.Отбор.ЭтапПродаж.Установить(Справочники.CRM_ЭтапыПродаж.ЗаявкаНаОборудование);
	НаборЗаявкаВыполнена = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьНаборЗаписей();
	НаборЗаявкаВыполнена.Отбор.IDK.Установить(РабочийЛист);
	НаборЗаявкаВыполнена.Отбор.ЭтапПродаж.Установить(Справочники.CRM_ЭтапыПродаж.ЗаявкаНаОборудованиеВыполнена);

    Если Статус = Перечисления.Renault_CRM_СтатусЗаявокНаОборудование.Черновик Тогда
		//НаборЗаявка.Записать();
		Нов = НаборЗаявка.Добавить();
		Нов.IDK = РабочийЛист;
		Нов.Объект = ЭтотОбъект.Ссылка;
		Нов.ДатаВыполнения = ЭтотОбъект.Дата;
		Нов.ДилерскийЦентр = ЭтотОбъект.ДилерскийЦентр;
		Нов.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаОборудование;
		НаборЗаявка.Записать();
    	НаборЗаявкаВыполнена.Записать();
	Иначе 
		Нов = НаборЗаявка.Добавить();
		Нов.IDK = РабочийЛист;
		Нов.Объект = ЭтотОбъект.Ссылка;
		Нов.ДатаВыполнения = ЭтотОбъект.Дата;
		Нов.ДилерскийЦентр = ЭтотОбъект.ДилерскийЦентр;
		Нов.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаОборудование;
		НаборЗаявка.Записать();
		
		Если Статус = Перечисления.Renault_CRM_СтатусЗаявокНаОборудование.Выполнена Тогда
			Нов = НаборЗаявкаВыполнена.Добавить();
			Нов.IDK = РабочийЛист;
			Нов.Объект = ЭтотОбъект.Ссылка;
			Нов.ДатаВыполнения = ЭтотОбъект.Дата;
			Нов.ДилерскийЦентр = ЭтотОбъект.ДилерскийЦентр;
			Нов.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаОборудованиеВыполнена;
			НаборЗаявкаВыполнена.Записать();

		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CRM_ВоронкаПродаж.IDK,
	               |	CRM_ВоронкаПродаж.ЭтапПродаж,
	               |	CRM_ВоронкаПродаж.ДатаВыполнения,
	               |	CRM_ВоронкаПродаж.Объект
	               |ИЗ
	               |	РегистрСведений.CRM_ВоронкаПродаж КАК CRM_ВоронкаПродаж
	               |ГДЕ
	               |	CRM_ВоронкаПродаж.Объект = &Объект";
	Запрос.УстановитьПараметр("Объект", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Запись.Прочитать();
		Если Запись.Выбран() Тогда
			Запись.Удалить();
		КонецЕсли;
	КонецЦикла;
		//Оповестить("ОбновитьРабочийЛист");
	
КонецПроцедуры

Процедура УстановитьСтатус(вхСтатус) Экспорт
	
	Статус = вхСтатус;
	Если Статус = Перечисления.Renault_CRM_СтатусЗаявокНаОборудование.Выполнена Тогда
		Черновик=Ложь;
		Закрыта = Истина;
		ВыполненаУспешно = Истина;
	ИначеЕсли  Статус = Перечисления.Renault_CRM_СтатусЗаявокНаОборудование.НаРассмотрении Тогда
		Черновик=Ложь;
		Закрыта = Ложь;
		ВыполненаУспешно = Ложь;
	//ИначеЕсли  Статус = Перечисления.Renault_CRM_СтатусЗаявокНаКредит.Одобрена Тогда
	//	Черновик=Ложь;
	//	Одобрена = Истина;
	//	Закрыта = Ложь;
	//	ВыполненаУспешно = Ложь;
	ИначеЕсли  Статус = Перечисления.Renault_CRM_СтатусЗаявокНаОборудование.Отменена Тогда
		Черновик=Ложь;
		//Одобрена = Ложь;
		Закрыта = Истина;
		ВыполненаУспешно = Ложь;
	ИначеЕсли  Статус = Перечисления.Renault_CRM_СтатусЗаявокНаОборудование.Черновик Тогда
		Черновик=Истина;
		//Одобрена = Ложь;
		Закрыта = Ложь;
		ВыполненаУспешно = Ложь;
	Иначе
		Статус = Перечисления.Renault_CRM_СтатусЗаявокНаОборудование.Черновик;
		Черновик=Истина;
		//Одобрена = Ложь;
		Закрыта = Ложь;
		ВыполненаУспешно = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры
